Repository: SAP/script-to-package-tool-for-macos
Catalog: Script2Pkg/Localizable.xcstrings
Source language: en
Languages: de

# alreadyNotarizedMessageText
source: A package can be notarized only once. Please select a package that has not been notarized and try again.
de: Ein Paket kann nur einmal beglaubigt werden. Bitte wählen Sie ein Paket aus, welches noch nicht beglaubigt wurde und versuchen Sie es erneut.

# alreadyNotarizedMessageTitle
source: The selected package has already been notarized!
de: Das ausgewählte Paket wurde bereits beglaubigt!

# alreadySignedMessageText
source: The selected package has already been signed. If you continue, the existing signature will be replaced.
de: Das ausgewählte Paket wurde bereits signiert. Wenn Sie fortfahren, wird die bestehende Signatur ersetzt.

# alreadySignedMessageTitle
source: Do you want to replace the existing signature?
de: Wollen Sie die bestehende Signatur ersetzen?

# buildButton
source: Build
de: Erstellen

# cancelButton
source: Cancel
de: Abbrechen

# commandLineToolsInstalledText
source: To notarize packages, Xcode 13, the Command Line Tools for Xcode 13, or later versions of these tools are required. Compatible versions of these tools have been detected as being installed, so notarizing should work as expected.
de: Um Pakete beglaubigen lassen zu können, sind Xcode 13, die Kommandozeilentools für Xcode 13, oder neuere Versionen dieser Programme notwendig. Die notwendige Software ist auf diesem Mac bereits installiert, sodass die Beglaubigung von Paketen problemlos funktionieren sollte.

# credentialsDialogText
source: Please sign in using an Apple ID associated with development team %@ and the app-specific password you have created for notarization.
de: Bitte melden Sie sich mit einer Apple ID, die dem Entwicklerteam %@ zugeordnet ist, und dem App-spezifischen Passwort, welches Sie für die Beglaubigung von Paketen angelegt haben, an.

# errorMessageText
source: Please check the activity window for details.
de: Bitte öffnen Sie das Aktivitätsfenster um Details zu erhalten.

# errorMessageTitle
source: Errors occurred while building packages.
de: Während der Paketerstellung sind Fehler aufgetreten.

# expiredSignatureMessageText
source: In order to get a package notarized by Apple, the package must be signed using a valid certificate. Please select a package containing a valid signature and try again.
de: Um ein Paket von Apple beglaubigen zu lassen, muss es mit einem gültigen Zertifikat signiert sein. Bitte wählen Sie ein Paket aus, welches über eine gültige Signatur verfügt und versuchen Sie es erneut.

# expiredSignatureMessageTitle
source: The selected package is signed using a certificate that has since expired!
de: Das ausgewählte Paket ist mit einem abgelaufenen Zertifikat signiert!

# invalidateButton
source: Invalidate
de: Verwerfen

# invalidateCredentialsMessageText
source: Invalidating credentials also disables notarization. You may re-enable notarization at any time, but you must provide valid credentials then.
de: Dies deaktiviert temporär die Beglaubigung von Paketen. Sie können die Beglaubigung jederzeit wieder aktivieren, müssen dann jedoch die entsprechenden Zugangsdaten neu eingeben.

# invalidateCredentialsMessageTitle
source: Are you sure you want to invalidate the stored credentials?
de: Sind Sie sicher, dass Sie die gespeicherten Zugangsdaten verwerfen wollen?

# invalidCredentialsMessageText
source: Notarization has been disabled due to missing or invalid credentials.
de: Die Beglaubigung von Paketen wurde aufgrund fehlender oder ungültiger Zugangsdaten deaktiviert.

# invalidCredentialsMessageTitle
source: Notarization has been disabled!
de: Die Beglaubigung von Paketen wurde deaktiviert!

# mainWindowAlternateText
source: at the location you have chosen in this app's settings
de: an dem Speicherort, den Sie in den Einstellungen dieses Programms ausgwählt haben

# mainWindowDefaultText
source: at the script's location
de: am selben Speicherort wie das Skript

# MTPackagingTaskState_0
source: Waiting
de: Warte

# MTPackagingTaskState_1
source: Building package
de: Paket wird erzeugt

# MTPackagingTaskState_2
source: Notarizing package
de: Paket wird beglaubigt

# MTPackagingTaskState_3
source: Copying package
de: Paket wird kopiert

# MTPackagingTaskState_4
source: Failed to build package
de: Paketerstellung fehlgeschlagen

# MTPackagingTaskState_5
source: Failed to notarize package
de: Beglaubigung des Pakets fehlgeschlagen

# MTPackagingTaskState_6
source: Failed to copy package
de: Kopieren des Pakets fehlgeschlagen

# MTPackagingTaskState_7
source: Cancelled
de: Abgebrochen

# MTPackagingTaskState_8
source: Complete
de: Fertig

# noSigningIdentityTooltip
source: This checkbox is disabled because no valid code signing identity has been found in your login keychain.
de: Dieses Kontrollkästchen ist deaktiviert, weil keine geeignete Signatur in Ihrem Anmeldeschlüsselbund gefunden wurde.

# notarizeButton
source: Notarize
de: Beglaubigen

# notarizeDialogMessage
source: Please select a package and click the "Notarize" button below to submit the package to the Apple Notary Service for notarization.
de: Bitte wählen Sie ein Paket aus und klicken Sie anschließend auf die Taste "Beglaubigen", um das Paket an den Apple Notary Service zur Beglaubigung zu übermitteln.

# notarizeFailedMessageText
source: The selected package could not be notarized.
de: Das ausgewählte Paket konnte nicht beglaubigt werden.

# notarizeFailedMessageTitle
source: Notarization failed!
de: Beglaubigung fehlgeschlagen!

# notarizeSuccessMessageText
source: The selected package has been successfully notarized by Apple.
de: Das ausgewählte Paket wurde erfolgreich von Apple beglaubigt.

# notarizeSuccessMessageTitle
source: Notarization successful!
de: Beglaubigung erfolgreich!

# notarytoolMissingTooltip
source: This checkbox is disabled because the notarytool command line tool has not been found. Please install the Command Line Tools for Xcode 13 or later to get notarytool and enable notarization.
de: Dieses Kontrollkästchen ist deaktiviert, weil das notarytool Kommandozeilentool nicht gefunden wurde. Bitte installieren Sie die Kommandozeilentools für Xcode 13 oder höher, um notarytool zu erhalten und aktivieren Sie anschließend die Beglaubigung von Paketen.

# openDialogMessage
source: Please select one or more scripts and click the "Build" button below to create a package from each script you selected.
de: Bitte wählen Sie ein oder mehrere Skripte aus und klicken Sie anschließend auf die Taste "Erstellen", um für jedes ausgewählte Skript ein Paket zu erstellen.

# packageFailNotificationMessage
source: The package "%@" could not be built.
de: Das Paket "%@" konnte nicht erstellt werden.

# packageFailNotificationTitle
source: Packaging failed!
de: Paketerstellung fehlgeschlagen!

# packageSuccessNotificationMessage
source: The package "%@" has been successfully built.
de: Das Paket "%@" wurde erfolgreich erstellt.

# packageSuccessNotificationTitle
source: Packaging successful!
de: Paketerstellung erfolgreich!

# pkgByApple
source: This package was created and signed by Apple.
de: Dieses Paket wurde von Apple erstellt und signiert.

# pkgExpired
source: This package is signed using a certificate that has since expired.
de: Dieses Paket ist mit einem abgelaufenen Zertifikat signiert.

# pkgExpiredDescription
source: The signature of this package has been expired. On Macs with Apple's Gatekeeper security feature enabled, installation of the package may be blocked.
de: Die Signatur dieses Pakets ist abgelaufen. Auf Macs, auf denen Apples Gatekeeper Sicherheitsfeature aktiviert ist, wird die Installation nicht möglich sein.

# pkgIsNotarized
source: This package was notarized by Apple.
de: Dieses Paket wurde von Apple beglaubigt.

# pkgIsNotarizedDescription
source: This package is signed with a digital certificate and trusted by Apple's notarization service. A user should be able to install this package without any problems.
de: Dieses Paket wurde mit einem digitalen Zertifikat signiert und von Apple beglaubigt. Es sollte sich problemlos installieren lassen.

# pkgIsSignedDescription
source: This package is signed with a digital certificate, but is not trusted by Apple's notarization service. If a user tries to install this package on Macs with Apple's Gatekeeper security feature enabled, macOS may warn the user because of the missing notarization. The user may be able to acknowledge this warning and successfully install the package.
de: Dieses Paket wurde mit einem digitalen Zertifikat signiert, aber nicht von Apple beglaubigt. Auf Macs, auf denen Apples Gatekeeper Sicherheitsfeature aktiviert ist, wird eine Warnung erscheinen. Wird diese Warnung akzeptiert, sollte sich das Paket problemlos installieren lassen.

# pkgNotNotarized
source: This package is not notarized.
de: Dieses Paket ist nicht beglaubigt.

# pkgNotSigned
source: This package is not signed.
de: Dieses Paket ist nicht signiert.

# pkgNotSignedDescription
source: This package is not signed with a digital certificate and is not trusted by Apple's notarization service. On Macs with Apple's Gatekeeper security feature enabled, installation of the package may be blocked because Apple's built-in security tools can't verify that it doesn't contain malware.
de: Dieses Paket wurde weder mit einem digitalen Zertifikat signiert, noch wurde sie von Apple beglaubigt. Auf Macs, auf denen Apples Gatekeeper Sicherheitsfeature aktiviert ist, wird die Installation nicht möglich sein, weil macOS nicht überprüfen kann, ob das Paket Schadsoftware enthält.

# pkgSignedBy
source: This package was signed by "%@".
de: Dieses Paket wurde signiert von "%@".

# replaceButton
source: Replace
de: Ersetzen

# selectButton
source: Select
de: Auswählen

# showWindowButton
source: Show activity window…
de: Aktivitätsfenster anzeigen…

# signButton
source: Sign
de: Signieren

# signDialogMessage
source: Please select a package and click the "Sign" button below to sign the package.
de: Bitte wählen Sie ein Paket aus und klicken Sie anschließend auf die Taste "Signieren", um das Paket zu signieren.

# signingDisabledTooltip
source: This checkbox is disabled because package signing is disabled and only signed packages may be notarized.
de: Dieses Kontrollkästchen ist deaktiviert, weil das Signieren von Paketen deaktiviert ist und nur signierte Pakete beglaubigt werden können.

# signingFailedMessageText
source: The selected package could not be signed.
de: Das ausgewählte Paket konnte nicht signiert werden.

# signingFailedMessageTitle
source: Signing failed!
de: Signieren fehlgeschlagen!

# signingSuccessMessageText
source: The selected package has been successfully signed.
de: Das ausgewählte Paket wurde erfolgreich signiert.

# signingSuccessMessageTitle
source: Signing successful!
de: Signieren erfolgreich!

# stoppingProgressLabel
source: Stopping…
de: Abbrechen …

# validateButton
source: Validate
de: Überprüfen

# validateDialogMessage
source: Please select a package and click the "Validate" button below to check the signature of the package.
de: Bitte wählen Sie ein Paket aus und klicken Sie anschließend auf die Taste "Überprüfen", um die Signatur des Pakets zu überprüfen.
